hiperiondev/esp32idf_APRS/main/main.c
// @file main.c
//
// @author Emiliano Augusto Gonzalez ( lu3vea @ gmail . com)
// @date 2026
// @copyright GNU General Public License v3
// @see https://github.com/hiperiondev/esp32idf_APRS
//
// @note
// This is based on other projects:
//     VP-Digi: https://github.com/sq8vps/vp-digi
//     ESP32APRS: https://github.com/nakhonthai/ESP32APRS_Audio
//     LibAPRS: https://github.com/markqvist/LibAPRS
//
//     please contact their authors for more information.
//
// @brief Firmware entry point: NVS/LittleFS bring-up, configuration load, WiFi
// station/AP setup and event handling, and creation of the application task that
// starts the CPU frequency policy, SNTP client, APRS services and the radio
// modem, bringing up the web admin server last once free heap allows it.

#include <string.h>

#include "esp_event.h"
#include "esp_log.h"
#include "esp_netif.h"
#include "esp_ota_ops.h"
#include "esp_system.h"
#include "esp_timer.h"
#include "esp_wifi.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "nvs_flash.h"

#include "app_config.h"
#include "aprs_service.h"
#include "cpu_freq.h"
#include "esp32idf_radioamateur_modem.h"
#include "gps.h"
#include "net_state.h"
#include "storage.h"
#include "telegram_app.h"
#include "time_sync.h"
#include "web_server.h"

static const char *TAG = "main";

// app_main() runs on the system "main" task, whose stack size is fixed by
// CONFIG_ESP_MAIN_TASK_STACK_SIZE (3584 bytes by default) and is not meant to
// host heavy work. wifi_init()/web_server_start() (esp_netif, esp_wifi,
// esp_http_server, cJSON, etc.) can easily use several KB of stack between
// them, which does not fit there. Rather than grow a stack shared with the
// system, all of that work runs on the dedicated task created below, with an
// explicit and generous stack size of its own.
#define APP_TASK_STACK_SIZE 8192
#define APP_TASK_PRIORITY   5

// Pause between the two boot attempts at reading config.json. The failure
// app_config_load() reports is a read that could not be completed at all
// (typically no contiguous heap for the parse), so the retry is worth making
// only after the allocations made during early startup have settled.
#define CONFIG_LOAD_RETRY_DELAY_MS 250

// Fixed delay applied before every reconnect attempt after a STA disconnect.
#define RECONNECT_INTERVAL_MS 5000

// Minimum free heap the web admin server waits for before it binds its
// listening socket, and the longest this boot will wait for that much to be
// free. The web server is started last, after every other service has made
// its own allocations, specifically so this check sees the heap in the state
// the station will actually run in.
#define WEB_SERVER_MIN_FREE_HEAP         (10 * 1024)
#define WEB_SERVER_HEAP_WAIT_MAX_MS      5000
#define WEB_SERVER_HEAP_POLL_INTERVAL_MS 100

// True when the configured wifi_mode includes a station interface AND a usable
// STA entry was actually found and pushed to the driver. Gates every automatic
// esp_wifi_connect(): without it, the WIFI_EVENT_STA_START handler below would
// also fire (and try to associate) when page_wireless.c's WiFi-scan handler
// temporarily flips an AP-only radio to AP+STA, which would fight the scan.
static bool s_staEnabled = false;

// One-shot timer used to defer a reconnect attempt, rather than a vTaskDelay()
// inside the event handler: event handlers run on the shared event-loop task,
// so sleeping there would stall every other event - including the
// IP_EVENT_STA_GOT_IP this code is waiting for, and the AP's own events while
// in AP+STA mode.
static esp_timer_handle_t s_reconnectTimer = NULL;

static void try_connect(const char *why) {
    if (!s_staEnabled)
        return;
    esp_err_t err = esp_wifi_connect();
    // esp_wifi_connect() failing is the whole reason this function exists:
    // a connect that never starts never produces a WIFI_EVENT_STA_DISCONNECTED
    // either, so the retry path (which lives in the disconnect handler) would
    // never run and the station would sit dead and silent. Reporting the
    // result of every attempt makes that case visible and recoverable.
    if (err == ESP_OK)
        ESP_LOGI(TAG, "STA connect requested (%s)", why);
    else
        ESP_LOGE(TAG, "STA connect (%s) failed: %s", why, esp_err_to_name(err));
}

static void reconnect_timer_cb(void *arg) {
    try_connect("retry");
}

static void wifi_event_handler(void *arg, esp_event_base_t base, int32_t id, void *data) {
    if (base != WIFI_EVENT)
        return;

    if (id == WIFI_EVENT_STA_START) {
        // esp_wifi_connect() is only legal once the station interface has
        // actually started, and esp_wifi_start() signals that by posting this
        // event - it does not finish the job before returning. Calling
        // esp_wifi_connect() on the app task immediately after esp_wifi_start()
        // can lose that race and return ESP_ERR_WIFI_NOT_STARTED, with no
        // association and no WIFI_EVENT_STA_DISCONNECTED to trigger a retry
        // (the retry lives only in the disconnect handler). Connecting from
        // here is the order ESP-IDF guarantees.
        try_connect("STA_START");
    } else if (id == WIFI_EVENT_STA_DISCONNECTED) {
        wifi_event_sta_disconnected_t *d = (wifi_event_sta_disconnected_t *)data;

        // No AP link -> definitely no internet route until we reconnect AND
        // get a fresh IP (see ip_event_handler below).
        net_state_set_connected(false);

        // The reason code is the single most useful number when a station
        // won't associate: 15 (4WAY_HANDSHAKE_TIMEOUT) or 204 (NOT_AUTHED)
        // means the password is wrong, 201 (NO_AP_FOUND) means the SSID
        // isn't visible (wrong name, out of range, or 5 GHz-only), 2/8/200
        // are ordinary roaming/AP-side drops.
        ESP_LOGW(TAG, "STA disconnected from '%s', reason %d, retrying in %u ms...", (d && d->ssid_len) ? (const char *)d->ssid : "?", d ? (int)d->reason : -1,
                 (unsigned)RECONNECT_INTERVAL_MS);

        // Deferred, not slept: see the note on s_reconnectTimer. Every
        // disconnect - whether transient or persistent - waits the same
        // fixed interval before the next esp_wifi_connect() attempt.
        if (s_reconnectTimer) {
            esp_timer_stop(s_reconnectTimer); // no-op if not armed
            esp_timer_start_once(s_reconnectTimer, (uint64_t)RECONNECT_INTERVAL_MS * 1000ULL);
        }
    } else if (id == WIFI_EVENT_AP_STACONNECTED) {
        ESP_LOGI(TAG, "Client connected to AP");
    }
}

// Fires once the STA interface actually has an IP (i.e. a real route to the
// internet, as opposed to merely being associated to the AP). This is the
// signal internet-dependent services (APRS-IS IGate) wait on before they
// attempt anything - see net_state.h.
static void ip_event_handler(void *arg, esp_event_base_t base, int32_t id, void *data) {
    if (base == IP_EVENT && id == IP_EVENT_STA_GOT_IP) {
        ip_event_got_ip_t *event = (ip_event_got_ip_t *)data;
        ESP_LOGI(TAG, "STA got IP: " IPSTR " - internet route available", IP2STR(&event->ip_info.ip));
        net_state_set_connected(true);
    }
}

// Applies the SoftAP settings from the running configuration.
//
// Nothing in here may abort. The access point is the only way back into the
// device when no station can associate, so a value the driver refuses has to
// end as a log line and a fallback, not as a panic: a panic lands before
// esp_wifi_start(), which leaves the device with no AP and no STA, rebooting
// into the same panic on every power cycle and recoverable only over serial.
//
// The channel is clamped on save and on load, so the retry below is the last
// line of defence for anything that still reaches the driver out of range.
static void wifi_apply_ap_config(void) {
    wifi_config_t ap_cfg = { 0 };
    size_t ssid_len = strnlen(g_config.wifi_ap_ssid, sizeof(ap_cfg.ap.ssid));
    memcpy(ap_cfg.ap.ssid, g_config.wifi_ap_ssid, ssid_len);
    ap_cfg.ap.ssid_len = (uint8_t)ssid_len;
    size_t pass_len = strnlen(g_config.wifi_ap_pass, sizeof(ap_cfg.ap.password));
    memcpy(ap_cfg.ap.password, g_config.wifi_ap_pass, pass_len);
    ap_cfg.ap.channel = g_config.wifi_ap_ch;
    ap_cfg.ap.max_connection = 4;
    ap_cfg.ap.authmode = strlen(g_config.wifi_ap_pass) >= 8 ? WIFI_AUTH_WPA2_PSK : WIFI_AUTH_OPEN;

    if (ap_cfg.ap.channel < WIFI_AP_CH_MIN || ap_cfg.ap.channel > WIFI_AP_CH_MAX) {
        ESP_LOGW(TAG, "SoftAP channel %u outside %u-%u, using %u", (unsigned)ap_cfg.ap.channel, (unsigned)WIFI_AP_CH_MIN, (unsigned)WIFI_AP_CH_MAX,
                 (unsigned)WIFI_AP_CH_DEFAULT);
        ap_cfg.ap.channel = WIFI_AP_CH_DEFAULT;
    }

    esp_err_t err = esp_wifi_set_config(WIFI_IF_AP, &ap_cfg);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "esp_wifi_set_config(AP) rejected the stored settings: %s - retrying on channel %u", esp_err_to_name(err), (unsigned)WIFI_AP_CH_DEFAULT);
        ap_cfg.ap.channel = WIFI_AP_CH_DEFAULT;
        err = esp_wifi_set_config(WIFI_IF_AP, &ap_cfg);
    }
    if (err != ESP_OK)
        ESP_LOGE(TAG, "esp_wifi_set_config(AP) failed: %s - the access point will not come up, fix the Wireless page over a station link or reflash",
                 esp_err_to_name(err));
}

static void wifi_init(void) {
    ESP_ERROR_CHECK(esp_netif_init());
    ESP_ERROR_CHECK(esp_event_loop_create_default());
    esp_netif_create_default_wifi_ap();
    esp_netif_create_default_wifi_sta();

