hiperiondev/esp32idf_APRS/main/main.c
    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_wifi_init(&cfg));
    ESP_ERROR_CHECK(esp_event_handler_register(WIFI_EVENT, ESP_EVENT_ANY_ID, &wifi_event_handler, NULL));
    ESP_ERROR_CHECK(esp_event_handler_register(IP_EVENT, IP_EVENT_STA_GOT_IP, &ip_event_handler, NULL));

    // Map this project's interface selector onto the IDF mode enum. The two
    // numbering schemes are independent, so the mapping is spelled out rather
    // than cast.
    wifi_mode_t mode = WIFI_MODE_NULL;
    switch (g_config.wifi_mode) {
        case WIFI_MODE_CFG_STA:
            mode = WIFI_MODE_STA;
            break;
        case WIFI_MODE_CFG_AP:
            mode = WIFI_MODE_AP;
            break;
        case WIFI_MODE_CFG_APSTA:
            mode = WIFI_MODE_APSTA;
            break;
        default:
            // Covers WIFI_MODE_CFG_OFF and any value outside the selector
            // range: the SoftAP comes up regardless, so the web admin is
            // always reachable and no stored value can lock the operator out
            // of a headless station.
            mode = WIFI_MODE_AP;
            break;
    }
    ESP_ERROR_CHECK(esp_wifi_set_mode(mode));

    if (mode == WIFI_MODE_AP || mode == WIFI_MODE_APSTA)
        wifi_apply_ap_config();

    if (mode == WIFI_MODE_STA || mode == WIFI_MODE_APSTA) {
        for (int i = 0; i < WIFI_STA_NUM; i++) {
            if (g_config.wifi_sta[i].enable && g_config.wifi_sta[i].wifi_ssid[0]) {
                wifi_config_t sta_cfg = { 0 };
                strncpy((char *)sta_cfg.sta.ssid, g_config.wifi_sta[i].wifi_ssid, sizeof(sta_cfg.sta.ssid) - 1);
                strncpy((char *)sta_cfg.sta.password, g_config.wifi_sta[i].wifi_pass, sizeof(sta_cfg.sta.password) - 1);

                // Advertise PMF capability. A zeroed wifi_config_t leaves
                // pmf_cfg.capable = false, and an AP configured for WPA3 or
                // WPA2 with PMF required will simply refuse such a station -
                // it associates and is immediately dropped, or never gets
                // past the handshake. "capable, not required" is the setting
                // that works against both old and new APs.
                sta_cfg.sta.pmf_cfg.capable = true;
                sta_cfg.sta.pmf_cfg.required = false;

                // Same reasoning as the AP path: the station credentials also
                // come from stored data, and a set that the driver refuses
                // must not take the boot down. Log it and try the next slot,
                // so the access point still comes up either way.
                esp_err_t serr = esp_wifi_set_config(WIFI_IF_STA, &sta_cfg);
                if (serr != ESP_OK) {
                    ESP_LOGE(TAG, "esp_wifi_set_config(STA) rejected slot %d ('%s'): %s - skipping it", i, g_config.wifi_sta[i].wifi_ssid,
                             esp_err_to_name(serr));
                    continue;
                }
                s_staEnabled = true;
                ESP_LOGI(TAG, "STA entry %d selected: SSID '%s'", i, g_config.wifi_sta[i].wifi_ssid);
                break; // first enabled entry; multi-AP failover can be added later
            }
        }

        // Loudly, because this is the other half of "I switched to STA and
        // nothing happened": if the loop above finds nothing, no STA config is
        // handed to the driver, and a bare esp_wifi_connect() would just return
        // ESP_ERR_WIFI_SSID into a discarded return value and fail silently.
        // Every WiFi Client block on the Wireless page has its own "Enable"
        // checkbox, separate from the Mode dropdown, and selecting Station mode
        // without ticking one leaves the station with nothing to connect to.
        if (!s_staEnabled) {
            ESP_LOGE(TAG, "wifi_mode=%u selects a station, but no WiFi Client entry is enabled with an SSID.", (unsigned)g_config.wifi_mode);
            // Dump every slot: "enabled but SSID empty" and "SSID set but not
            // enabled" are different mistakes with different fixes, and the
            // single summary line above cannot tell them apart.
            for (int i = 0; i < WIFI_STA_NUM; i++) {
                ESP_LOGE(TAG, "     slot %d: enable=%s ssid='%s'%s", i, g_config.wifi_sta[i].enable ? "true" : "false", g_config.wifi_sta[i].wifi_ssid,
                         (g_config.wifi_sta[i].enable && !g_config.wifi_sta[i].wifi_ssid[0])   ? "   <-- enabled, but the SSID is EMPTY"
                         : (!g_config.wifi_sta[i].enable && g_config.wifi_sta[i].wifi_ssid[0]) ? "   <-- has an SSID, but 'Enable' is not ticked"
                                                                                               : "");
            }
            ESP_LOGE(TAG, "  -> On the Wireless page, tick 'Enable' in a WiFi Client block and type an SSID, then Save.");
            if (mode == WIFI_MODE_STA) {
                // STA-only with nothing to join means no AP either: the device
                // would be unreachable over the air with no way back short of a
                // serial reflash. Fall back to AP+STA so the web admin stays up.
                ESP_LOGW(TAG, "  -> Falling back to AP+STA so the web admin stays reachable on '%s'.", g_config.wifi_ap_ssid);
                mode = WIFI_MODE_APSTA;
                ESP_ERROR_CHECK(esp_wifi_set_mode(mode));
                wifi_apply_ap_config();
            }
        }
    }

    // Armed by the disconnect handler, fired on the esp_timer task - never on
    // the event loop. Created before esp_wifi_start() so it exists by the time
    // the first event can arrive.
    if (s_staEnabled) {
        const esp_timer_create_args_t targs = {
            .callback = reconnect_timer_cb,
            .name = "wifi_reconnect",
        };
        ESP_ERROR_CHECK(esp_timer_create(&targs, &s_reconnectTimer));
    }

    ESP_ERROR_CHECK(esp_wifi_start());

    // Modem sleep off. The default powers the radio down between DTIM beacons,
    // which suits a sensor that wakes, posts and sleeps again; this station
    // instead holds an APRS-IS socket, an admin web server and, when the
    // Telegram bot is enabled, a TLS long poll, all at once and all of them
    // latency-sensitive. With the radio asleep most of the time, transmits
    // queue behind the next wake-up: sockets report EAGAIN under load and a
    // TLS handshake can exhaust its whole timeout while a plain connection to
    // the same address completes in a few hundred milliseconds.
    //
    // A sleeping radio also misses the periodic WPA2 group key update some
    // access points perform, which disconnects the station with reason 16 and
    // takes every open connection down with it.
    //
    // The cost is receiver current draw, which an always-on gateway on mains
    // power can afford. A battery-powered installation that does not run the
    // bot may prefer WIFI_PS_MIN_MODEM here.
    esp_err_t ps_err = esp_wifi_set_ps(WIFI_PS_NONE);
    if (ps_err != ESP_OK)
        ESP_LOGW(TAG, "Could not disable WiFi modem sleep: %s", esp_err_to_name(ps_err));

    // No esp_wifi_connect() here any more - WIFI_EVENT_STA_START does it, once
    // the driver says the station is genuinely up. See the handler.

