hiperiondev/esp32idf_APRS/main/main.c
    // The units differ: the config field is dBm, esp_wifi_set_max_tx_power()
    // takes quarter-dBm, hence the x4. Both the form and config.json paths
    // clamp the stored value to WIFI_TX_POWER_DBM_MIN..MAX, so the product
    // always lands inside the range the driver accepts and fits an int8_t.
    // Only meaningful once the radio is started.
    int8_t qdbm = (int8_t)(g_config.wifi_power * 4);
    esp_err_t perr = esp_wifi_set_max_tx_power(qdbm);
    if (perr != ESP_OK)
        ESP_LOGW(TAG, "esp_wifi_set_max_tx_power(%d dBm) failed: %s", (int)g_config.wifi_power, esp_err_to_name(perr));

    ESP_LOGI(TAG, "WiFi started in mode %d (AP SSID '%s', STA %s)", (int)mode, g_config.wifi_ap_ssid, s_staEnabled ? "enabled" : "disabled");
}

// Blocks until esp_get_free_heap_size() reaches WEB_SERVER_MIN_FREE_HEAP or
// WEB_SERVER_HEAP_WAIT_MAX_MS has elapsed, whichever comes first, then starts
// the web admin server either way. Every other service has already made its
// allocations by the time this runs, so a heap that is still short after the
// wait is reported and the server is started anyway: an admin UI reachable
// under memory pressure is more useful to the operator than no admin UI at
// all, and refusing to start it here would leave the station with no way to
// diagnose or reconfigure itself over the network.
static void web_server_start_when_heap_ready(void) {
    TickType_t start = xTaskGetTickCount();
    uint32_t freeHeap = esp_get_free_heap_size();

    while (freeHeap < WEB_SERVER_MIN_FREE_HEAP) {
        TickType_t elapsedTicks = xTaskGetTickCount() - start;
        if (elapsedTicks >= pdMS_TO_TICKS(WEB_SERVER_HEAP_WAIT_MAX_MS)) {
            ESP_LOGW(TAG, "Free heap still %u bytes after %d ms wait (wanted %u), starting web admin anyway", (unsigned)freeHeap, WEB_SERVER_HEAP_WAIT_MAX_MS,
                     (unsigned)WEB_SERVER_MIN_FREE_HEAP);
            break;
        }
        vTaskDelay(pdMS_TO_TICKS(WEB_SERVER_HEAP_POLL_INTERVAL_MS));
        freeHeap = esp_get_free_heap_size();
    }

    web_server_start();
}

// All of the actual application work happens here, on a task created with
// its own APP_TASK_STACK_SIZE stack, isolated from the system main task.
static void app_task(void *arg) {
    // Loads config.json, or writes+loads factory defaults if missing/corrupt.
    // A false return is the one case that leaves g_config untouched - the file
    // is believed intact but could not be read - so the whole station would
    // otherwise run from a zero-initialized struct: no callsign, no beacon
    // intervals, and an AP whose SSID is an empty string. Retry once, then put
    // the factory set in place so the device always comes up on a reachable
    // web admin the operator can correct it from.
    if (!app_config_load()) {
        ESP_LOGW(TAG, "Configuration load failed, retrying in %d ms", CONFIG_LOAD_RETRY_DELAY_MS);
        vTaskDelay(pdMS_TO_TICKS(CONFIG_LOAD_RETRY_DELAY_MS));
        if (!app_config_load()) {
            ESP_LOGE(TAG, "Configuration could not be loaded, applying factory defaults");
            app_config_set_defaults(&g_config);
            // Persisting them is what makes the fallback survive the next
            // reset. Failing to do so is worth reporting but not worth
            // stopping the boot for: the defaults are already live in RAM.
            if (!app_config_save())
                ESP_LOGE(TAG, "Factory defaults could not be written, this boot runs from RAM only");
        }
    }

    // Apply the user-configured CPU frequency (System page) to the running
    // system, so the saved setting takes effect on the real clock and not only
    // in the UI.
    cpu_freq_apply();

    // Reset the "do we have internet" flag before bringing WiFi up; igate_start()
    // (below, via aprs_service_start()) polls this and waits for a real IP
    // before ever attempting an APRS-IS connection.
    net_state_init();

    wifi_init();
    // Yield here: wifi_init() leaves association/DHCP settling on this core,
    // and without a delay app_task can hog the CPU long enough (esp. AP+STA
    // mode) that IDLE1 never runs and the task watchdog fires a false alarm.
    vTaskDelay(pdMS_TO_TICKS(10));
    time_sync_start();

    // Bring the GNSS receiver up if the operator has it switched on. Done
    // before the web server so a page loaded as soon as the web admin answers
    // already finds the reader task running and reports the true link state
    // instead of "no data". The GPS page's save handler calls this again
    // whenever the switch moves, so enabling or disabling the receiver needs
    // no reboot.
    gps_apply_config();

    // If this boot is running an image that the web admin's OTA Update
    // (About / Firmware page) just flashed, CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE
    // (see partitions.csv) leaves it in "pending verify" state: the bootloader
    // will silently roll back to the previous OTA slot on the *next* reset
    // unless something here confirms the image is good first. Reaching this
    // point means NVS/LittleFS mounted and WiFi came up - a reasonable bar
    // for "this firmware works" - so confirm it. On a single-"factory"
    // partition table there is no pending-verify state to find and this is a
    // harmless no-op.
    {
        esp_ota_img_states_t ota_state;
        const esp_partition_t *running = esp_ota_get_running_partition();
        if (esp_ota_get_state_partition(running, &ota_state) == ESP_OK && ota_state == ESP_OTA_IMG_PENDING_VERIFY) {
            esp_err_t err = esp_ota_mark_app_valid_cancel_rollback();
            if (err == ESP_OK)
                ESP_LOGI(TAG, "OTA image confirmed valid on partition '%s' (rollback cancelled)", running->label);
            else
                ESP_LOGW(TAG, "esp_ota_mark_app_valid_cancel_rollback failed: %s", esp_err_to_name(err));
        }
    }

    // Bring up the AFSK/AX.25 modem + callsign/path settings from g_config,
    // then start the digipeater/igate/message application layer (aprs_service.c).
    //
    // The modem's runtime settings live in a modem_config_t, built from
    // g_config by aprs_service_build_modem_config() so the same mapping serves
    // here, the live re-apply on the Radio page, and the LOOP TEST (which only
    // flips full_duplex on top of it).
    //
    // What is deliberately NOT in that struct: the ADC, DAC and PTT pins and
    // the ADC attenuation are compile-time constants (see the
    // idf_build_set_property() block in the top-level CMakeLists.txt), and the
    // AGC gain ceiling and squelch threshold do not exist as settings at all -
    // the modem's AGC needs no ceiling and there is no software squelch, since
    // the AX.25 decoder gates on real DCD instead. None of them have g_config
    // fields, and none are selectable on the Radio/Modem page.
    //
    // aprs_service_start() must run before modem_init(): it installs the RX
    // callback, and the component starts delivering frames from inside
    // modem_init().
    aprs_service_start();

