hiperiondev/esp32idf_APRS/main/main.c
    // Only bring up the audio ADC/DAC AFSK modem hardware when it's enabled
    // on the Radio / Modem (Audio / AFSK) webconfig page.
    if (g_config.audio_modem_en) {
        modem_config_t modem_cfg;
        aprs_service_build_modem_config(&modem_cfg, false);

        // Note: modem_init() blocks for ~5 s while it measures this board's
        // real ADC sample rate (see ModemCalibrateSampleRate() in the
        // component). That is expected and happens exactly once per boot.
        esp_err_t err = modem_init(&modem_cfg);
        if (err != ESP_OK) {
            ESP_LOGE(TAG, "modem_init() failed: %s - RF TX/RX disabled", esp_err_to_name(err));
        } else {
            aprs_service_notify_modem_ready();
        }
    } else {
        ESP_LOGI(TAG, "Audio ADC/DAC AFSK modem disabled in config - skipping modem_init()");
    }

    // Bring the Telegram bot up if the operator has it switched on, and do it
    // after the modem on purpose. A TLS session and the modem's DMA buffers
    // both want large contiguous allocations out of the same internal RAM,
    // and this is a radio station: the transmitter has first claim. Starting
    // the bot after modem_init() means a heap too small for both costs the
    // convenience rather than the radio, and the Telegram page says so in as
    // many words.
    //
    // Its own supervisor task performs the bring-up in the background and
    // waits for a network route itself, so this call returns immediately and
    // never blocks the boot behind a TLS handshake. The Telegram page's save
    // handler calls this again whenever a setting moves, so the bot needs no
    // reboot.
    telegram_app_apply_config();

    // The web admin server is started last, once every other service above
    // has already made its allocations: esp_http_server's own buffers and
    // every admin page it can serve are the least critical thing running on
    // this station, so they are the ones asked to wait on the heap rather
    // than the radio or the APRS-IS uplink.
    web_server_start_when_heap_ready();

    // Do not log the admin password: this line reaches serial console captures
    // and any future remote-logging feature. Only the username is logged; the
    // operator already has the configured password.
    ESP_LOGI(TAG, APRS_SOFTWARE_NAME " web admin ready. Login user: %s", g_config.http_username);

    // Initialisation is done and everything above runs in its own tasks now
    // (WiFi, web server, APRS service + its tick, the beacon scheduler, the
    // modem RX/service tasks). app_task owns nothing beyond its own stack and
    // doesn't need to stay resident, so delete it instead of parking it in an
    // idle loop - this returns its APP_TASK_STACK_SIZE (8 KB) to the heap.
    vTaskDelete(NULL);
}

void app_main(void) {
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);

    if (!storage_init()) {
        ESP_LOGE(TAG, "LittleFS mount failed - config cannot persist!");
    }

    BaseType_t ok = xTaskCreate(app_task, "app_task", APP_TASK_STACK_SIZE, NULL, APP_TASK_PRIORITY, NULL);
    if (ok != pdPASS) {
        ESP_LOGE(TAG, "Failed to create app_task (out of memory?)");
    }

    // app_main can now return; the system main task frees its stack and
    // FreeRTOS deletes the task automatically (idf.py default behavior).
}
